public class VariableNameTheme {
    public static void main(String[] args) {
        //Задание 1. Разные переменные
        System.out.println("Задание 1. Разные переменные");

        //цифра
        int number = 5;
        System.out.println("\n1.цифра = " + number);

        //сумма чисел
        int sumOfNumbers = 7 + 8;
        System.out.println("\n2.сумма чисел = " + sumOfNumbers);

        //произведение цифр
        int productOfNumbers = 9 * 4;
        System.out.println("\n3.произведение цифр = " + productOfNumbers);

        //максимальное число
        int maxNumber = 99864756;
        System.out.println("\n4.максимальное число = " + maxNumber);

        //количество десятков
        int tensOfNumber = 1;
        System.out.println("\n5.количество десятков = " + tensOfNumber);

        //вес собаки
        int weightDog = 15;
        System.out.println("\n6.вес собаки = " + weightDog + " кг");

        //исходное число
        int originalNumber = 33;
        System.out.println("\n7.исходное число = " + originalNumber);

        //процент по вкладу
        double interestOnDeposit = 18.6d;
        System.out.println("\n8.процент по вкладу = " + interestOnDeposit + '%');

        //переменная хранит символ &
        char variableSymbol = '&';
        System.out.println("\n9.переменная хранит символ & = " + variableSymbol);

        //код ошибки
        int codeError = 404;
        System.out.println("\n10.код ошибки = " + codeError);

        //тип сообщения
        String typeMessage = "Скрытый";
        System.out.println("\n11.тип сообщения = " + typeMessage);

        //число нулей
        int numberOfZeros = 6;
        System.out.println("\n12.число нулей = " + numberOfZeros);

        //уникальное число
        float uniqueNumber = 3.14f;
        System.out.println("\n13.уникальное число = " + uniqueNumber);

        //случайное число
        int randomNumber  = 777;
        System.out.println("\n14.случайное число = " + randomNumber);

        //математическое выражение
        String mathExpression = "((3+8)*73)";
        System.out.println("\n15.математическое выражение = " + mathExpression);

        //выбор
        String choice = "выбор есть всегда";
        System.out.println("\n16.выбор = " + choice);

        //счет в игре
        String gameScore = "5-0";
        System.out.println("\n17.счет в игре = " + gameScore);

        //максимальная длина
        int maxLength = 100;
        System.out.println("\n18.максимальная длина = " + maxLength + "м");

        //пункт меню
        int menuItem = 27;
        System.out.println("\n19.пункт меню = " + menuItem);

        //стоимость кофе
        int priceCoffe = 1;
        System.out.println("\n20.стоимость кофе = " + priceCoffe + '$');

        //дата начала
        String startData = "19.05.2024";
        System.out.println("\n21.дата начала = " + startData);

        //окончание диапазона
        int endOfRange = 2147483647;
        System.out.println("\n22.окончание диапазона = " + endOfRange);

        //полное имя работника месяца
        String fullNameEmployeeMonth = "Въющ Геннадий Петерович";
        System.out.println("\n23.полное имя работника месяца = " + fullNameEmployeeMonth);

        //заголовок электронной книги
        String titleEbook = "Рассказы";
        System.out.println("\n24.заголовок электронной книги = " + titleEbook);

        //размер
        int size = 48;
        System.out.println("\n25.размер = " + size);

        //вместимость
        int capacity = 5;
        System.out.println("\n26.вместимость = " + capacity + "м3");

        //счетчик
        int counter = 1756;
        System.out.println("\n27.счетчик = " + counter);

        //путь до файла
        String pathToFile = "C:/Users/Александр/Desktop/StartJava";
        System.out.println("\n28.путь до файла = " + pathToFile);

        //количество чисел в каждой строке
        int numberOfDigitsLines = 21;
        System.out.println("\n29.количество чисел в каждой строке = " + numberOfDigitsLines);


        //Задание 2. boolean-переменные
        System.out.println("\nЗадание 2.boolean-переменные");

        //сотни равны?
        boolean hasEqualHundreds = false;
        System.out.println("\n1.сотни равны? " + hasEqualHundreds);

        //компьютер включен?
        boolean isTurnedComputer = false;
        System.out.println("\n2.омпьютер включен? " + isTurnedComputer);

        //есть равные цифры?
        boolean hasEqualDigits = true;
        System.out.println("\n3.есть равные цифры? " + hasEqualDigits);

        //создано?
        boolean isCraeted = false;
        System.out.println("\n4.создано? " + isCraeted);

        //пустое?
        boolean isEmpty = true;
        System.out.println("\n5.пустое? " + isEmpty);

        //активное?
        boolean active = true;
        System.out.println("\n6.активное? " + active);

        //новое?
        boolean isNew = false;
        System.out.println("\n7.новое? " + isNew);

        //электронная почта действительная?
        boolean isValidEmal = true;
        System.out.println("\n8.электронная почта действительная? " + isValidEmal);

        //имеются уникальные строки?
        boolean hasUniqueString = true;
        System.out.println("\n9.имеются уникальные строки? " + hasUniqueString);

        //Задание 3. Аббревиатуры
        System.out.println("\nЗадание 3.Аббревиатуры");

        //старый universally unique identifie
        String uuid = "UUID";
        System.out.println("\n1.старый universally unique identifie - " + uuid);

        //производитель оперативной памяти
        String ram = "RAM";
        System.out.println("\n2.производитель оперативной памяти - " + ram);

        //емкость жесткого диска
        String hdd = "HDD";
        System.out.println("\n3.емкость жесткого диска - " + hdd);

        //протокол передачи гипертекста
        String http = "HTTP";
        System.out.println("\n4.протокол передачи гипертекста -" + http);

        //сокращенный uniform resource locator
        String url  = "URL";
        System.out.println("\n5.сокращенный uniform resource locator - " + url);

        //новый идентификатор клиента
        String cuid = "CUID";
        System.out.println("\n6.новый идентификатор клиента - " + cuid);

        //кодировка american standard code for information interchange
        String ascii = "ASCII";
        System.out.println("\n7.кодировка american standard code for information interchange - " 
                + ascii);
    }
}